TTTbackend/app/controllers/users_controller.rb

INSERT INTO "users" ("email", "password_digest", "created_at", "updated_at", "username") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    @user = User.create(email: params[:email], username: params[:username], password: params[:password])

DELETE FROM "users" WHERE "users"."id" = $1  [["id", 3]]
---
  def destroy
    current_user.delete